# install libraries
pip install pandas
pip install seaborn
pip install numpy

In [25]:
# install libraries
import pandas as pd
import seaborn as sns
import numpy as np

In [26]:
kashti=sns.load_dataset('titanic')
ks1=kashti
ks2=kashti
ks=sns.load_dataset('titanic')

In [27]:
# kashti.head()

In [28]:
# # simple operation (math operator)
# (kashti['age']+12).head(10)

In [29]:
# (kashti['age']*6).head(10)

# Dealing with missing values
* in dataset missing values are either? or N/A or nan, or 0 or blank cell

* jb kbi data na ho kisi 1 row main kisi b 1 parameter ka

Steps:

1. koshish kren dobara data collect krlen ya dekh len agr khen ghlti h
2. missing value wala variable (column) he nikal den agr data pr effect nhe hota ya simple row ya data entry remove krden
3. Replace the missing values:
   * how?
   1. *  averge value of entire variable or similar data point
   2. *  frequency or MODE replacement
   3. *  replace based on other function (data sampler knows that)
   4. *  ML algorithm can also used
   5. *  leave it like that
   *  why?
   1. *  it is better bcz no data lost
   2. *  less accurate

In [30]:
# where exactly missing vakues are?
kashti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [31]:
# use drop.na method
print(kashti.shape)
kashti.dropna(subset=['deck'],axis=0,inplace=True) # this will remove specifically
# inplace= true modifies the data frame

(891, 15)

In [32]:
kashti.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [33]:
# to drop na 
kashti=kashti.dropna()
# to update the main data frame
kashti.isnull().sum() # remove na from whole dataframe

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [34]:
kashti.shape

(182, 15)

In [35]:
ks1.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

# replacing missing values with average of that mean

In [36]:
# finding an averge mean
mean=ks1['age'].mean()
mean

35.77945652173913

In [37]:
# replacing nan with mean of data (update as well)
ks1['age']=ks1['age'].replace(np.nan,mean)

In [38]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [39]:
# replacing nan with mean of data (update as well)
ks1['deck']=ks1['deck'].replace(np.nan,mean)

In [40]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

# DATA FRAMING

Data ko 1 common standard pr lana 

Ensure data is consistent and 

karachi (kch)

lahore(lhr)

mass(kg)

In [41]:
# know the data type and convert it into the known one
kashti.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [42]:
# use  this method to convert datatype from one to another formate 
kashti['survived']=kashti['survived'].astype("int64")
kashti.dtypes

C:\Users\alias\AppData\Local\Temp/ipykernel_13172/1215331428.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  kashti['survived']=kashti['survived'].astype("int64")

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [43]:
# use  this method to convert datatype from one to another formate 
kashti['survived']=kashti['survived'].astype("float64")
kashti.dtypes

C:\Users\alias\AppData\Local\Temp/ipykernel_13172/495076436.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  kashti['survived']=kashti['survived'].astype("float64")

survived        float64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [44]:
# here we will convert the age into days instead of years
ks1['age']=ks1['age']*365
ks1.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870.00000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775.00000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710.00000,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460.00000,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170.00000,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
21,1,2,male,12410.00000,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
23,1,1,male,10220.00000,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
27,0,1,male,6935.00000,3,2,263.0000,S,First,man,True,C,Southampton,no,False
31,1,1,female,13059.50163,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
52,1,1,female,17885.00000,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False

In [45]:
# always rename afterwards
ks1.rename(columns={"age":"age in days"},inplace=True)
ks1.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

# Data Normalization
1. uniform the data
2. making user they have the same impact
3. aik machli samunder main aur 1 jar main
4. also for computational reasons

In [46]:
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1.0,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1.0,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0.0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1.0,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1.0,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [47]:
ks4=kashti[["age in days",'fare']]
ks4.head()

KeyError: "['age in days'] not in index"

the above data is really in wide range and we need to normlize and hard to compare 

normalization change the values to the range of 0 and 1 (now both variables has similer influebce on our model)

# Method of Normalization

1. Simple feature scaling
    - x(new)=x(old)/x(max)
2. min-max method
3. Z-score(standard) -3 to 3
4. log transformation

In [ ]:
# simpler feature scalling 
ks4['fare']=ks4['fare']/ks4['fare'].max()
ks4.head()

In [ ]:
# MIN - MAX method
ks4['fare']=(ks4['fare']-ks4['fare'].min())/ (ks4['fare'].max()-ks4['fare'].min())
ks4.head()

In [ ]:
# Z-score 
ks4['fare']=(ks4['fare']-ks4['fare'].mean()) / ks4['fare'].std()
ks4.head()

In [ ]:
ks.head()

In [ ]:
# log transformation
ks['fare']=np.log(ks['fare'])
ks.head()

# Binning
1. Grouping of values into smaller number of Values (bins)
2. convert numeric into categories 
3. to have better understanding of groups 
    - low vs mid vs high price

In [48]:
bins=np.linspace(min(kashti['age']),max(kashti['age']),15000)
age_groups=["Bachy","Jawan","Boorhay"]
kashti['age']=pd.cut(kashti['age'],3,lablel=age_groups,include_lowest=True)
kashti['age']

TypeError: cut() got an unexpected keyword argument 'lablel'